app/views/messages/index.html.erb

    <%@user.message_receiveds.each do |message|%>
      <li><%=link_to User.find_by(id: message.sender_id).name,"/profile/#{message.sender_id}" %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 27 LIMIT 1