app/views/users/index.html.erb

<% if session[:user_id] %>
  Welcome! <%= User.find(session[:user_id]).name %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 13]]