app/controllers/follows_controller.rb

  def create
      follower= User.find_by(id: params[:id].to_i)
    if !@user.followers.find_by(id: params[:id].to_i)
      f = Follow.new
      f.follower_id = follower.id
      f.followee_id = @user.id
      f.save
---
SELECT  "users".* FROM "users"  WHERE "users"."id" IS NULL LIMIT 1
INSERT INTO "follows" ("followee_id", "follower_id") VALUES (?, ?)  [["followee_id", 15], ["follower_id", 15]]

  def destroy
    follow = Follow.find_by(follower_id: params["id"].to_i, followee_id: @user.id)
    Follow.delete(follow.id)
---
SELECT  "follows".* FROM "follows"  WHERE "follows"."follower_id" = 15 AND "follows"."followee_id" = 15 LIMIT 1
DELETE FROM "follows" WHERE "follows"."id" = 20