app/controllers/messages_controller.rb

  def create
    m = Message.new
    m.receiver_id = params[:receiver_id].to_i
    m.content = params[:content]
    m.sender_id = @user.id
    m.save
---
INSERT INTO "messages" ("content", "receiver_id", "sender_id") VALUES (?, ?, ?)  [["content", "what"], ["receiver_id", 31], ["sender_id", 27]]

  def new
    @destination = User.find_by(id: params[:id].to_i)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 27 LIMIT 1