app/controllers/places_controller.rb

  def index
      @places = Place.all
---
SELECT "places".* FROM "places"

  def show
      @place = Place.find_by(:title => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."title" = 'Summer Palace' LIMIT 1

  def delete
      @place = Place.find_by(:title => params["id"])
      @place.delete
---
SELECT  "places".* FROM "places"  WHERE "places"."title" = 'Summer Palace' LIMIT 1
DELETE FROM "places" WHERE "places"."id" = 4

  def create
      Place.create(:title => params["title"], :price => params["price"], :description=> params["description"] , :photourl => params["photourl"])
---
INSERT INTO "places" ("description", "photourl", "price", "title") VALUES (?, ?, ?, ?)  [["description", "asfd"], ["photourl", "asfd"], ["price", 0], ["title", "safd"]]

  def edit
      @place = Place.find_by(:title => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."title" = 'Summer Palace' LIMIT 1

  def update
      @place = Place.find_by(:title => params["id"])
      @place.title = params["title"]
      @place.price = params["price"]
      @place.description = params["description"]
      @place.photourl = params["photourl"]
      @place.save
---
SELECT  "places".* FROM "places"  WHERE "places"."title" = ':title' LIMIT 1
UPDATE "places" SET "title" = ? WHERE "places"."id" = 25  [["title", "Badaling great 1212"]]