app/controllers/places_controller.rb

  def show
      @place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 0 LIMIT 1

  def delete
      @place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 0 LIMIT 1

  def edit
      @place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 23 LIMIT 1

  def update
      @place = Place.find_by(:id => params["id"])
---
SELECT  "places".* FROM "places"  WHERE "places"."id" = 0 LIMIT 1