app/controllers/searchs_controller.rb

  def index
    search = @user.searchs.last
    if search
      @searches = User.where("age= ? AND region= ? AND sex= ?",search.age, search.region, search.sex)
---
SELECT  "searches".* FROM "searches"  WHERE "searches"."user_id" = ?  ORDER BY "searches"."id" DESC LIMIT 1  [["user_id", 32]]
SELECT "users".* FROM "users"  WHERE (age= 25 AND region= 'California' AND sex= 'female')

  def create
    s = Search.new
    s.age = params[:age]
    s.sex = params[:sex]
    s.region = params[:region]
    s.searcher_id = @user.id
    s.save
---
INSERT INTO "searches" ("age", "region", "searcher_id", "sex") VALUES (?, ?, ?, ?)  [["age", 32], ["region", "California"], ["searcher_id", 42], ["sex", "male"]]