app/controllers/users_controller.rb

    def index
      @users = User.limit(20)
      if session[:user_id]
        @user = User.find_by(id: session[:user_id])
---
SELECT  "users".* FROM "users"  LIMIT 20
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]

    def create
      @user= User.new
      @user.name = params[:name]
      @user.email = params[:email]
      @user.age = params[:age]
      @user.sex = params[:sex]
      @user.password = params[:password]
      @user.password_confirmation = params[:password_confirmation]
      @user.region = params[:region]

      if @user.save
---
INSERT INTO "users" ("age", "email", "name", "password_digest", "region", "sex") VALUES (?, ?, ?, ?, ?, ?)  [["age", 21], ["email", "hhe8@uchicago.edu"], ["name", "Huimin"], ["password_digest", "$2a$10$oOz2J3Z.uPQ4C2W4nH65Ue2a88TDzTkrzYT8Cg5oh8a46xe5n9nTC"], ["region", "Illinois"], ["sex", "male"]]

    def update
      @user.name = params[:name]
      @user.email = params[:email]
      @user.age = params[:age]
      @user.sex = params[:sex]
      @user.region = params[:region]
      @user.status = params[:status]
      @user.save
---
UPDATE "users" SET "age" = ?, "email" = ?, "name" = ?, "sex" = ? WHERE "users"."id" = 8  [["age", 19], ["email", "simon@example.com"], ["name", "Simon"], ["sex", "male"]]

    def profile
      @user = User.find_by(id: params[:id].to_i)
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 13 LIMIT 1